<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"4b62b4005a07fbd6e40071a556889e378a1f7f053b0b62c0dfa73894129dcfa4","plan_job_ref":"Job Plan org changes and list them in a PR #77 at https://github.com/django-commons/membership/actions/runs/13566874741","plan_out_hash":"4adbce136adef2085aeb179983bcb4e268a36dc70b87af2fb436d2f2f390e8ae","plan_hash":"f6a254e26e571d9084de638d3c4b16a5e2ceec20389665e07a6e1f99f849519f","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 2 to import, 11 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_repository.this["django-click"] will be updated in-place
  # (imported from "django-click")
!~  resource "github_repository" "this" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
!~      allow_squash_merge          = true -> false
!~      allow_update_branch         = false -> true
+       archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
!~      delete_branch_on_merge      = false -> true
        description                 = "Write Django management command using the click CLI library"
        etag                        = "W/\"be37dd9dbf617d321e03aba11ec9d8adc21a4aa9cf4597abb6fca915e788ea87\""
        full_name                   = "django-commons/django-click"
        git_clone_url               = "git://github.com/django-commons/django-click.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
!~      has_wiki                    = true -> false
        homepage_url                = null
        html_url                    = "https://github.com/django-commons/django-click"
        http_clone_url              = "https://github.com/django-commons/django-click.git"
        id                          = "django-click"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "django-click"
        node_id                     = "********************************"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 42274797
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:django-commons/django-click.git"
        svn_url                     = "https://github.com/django-commons/django-click"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_collaborators.this["django-click"] will be updated in-place
  # (imported from "django-click")
!~  resource "github_repository_collaborators" "this" {
        id             = "django-click"
!~      invitation_ids = {} -> (known after apply)
        repository     = "django-click"

        team {
            permission = "pull"
            team_id    = "*************"
        }
+       team {
+           permission = "admin"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "maintain"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "triage"
+           team_id    = (known after apply)
        }

-       user {
-           permission = "push" -> null
-           username   = "FlipperPA" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "GaretJax" -> null
        }
    }

  # github_repository_environment.pypi["django-click"] will be created
+   resource "github_repository_environment" "pypi" {
+       can_admins_bypass   = true
+       environment         = "pypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-click"

+       reviewers {
+           teams = (known after apply)
        }
    }

  # github_repository_environment.testpypi["django-click"] will be created
+   resource "github_repository_environment" "testpypi" {
+       can_admins_bypass   = true
+       environment         = "testpypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-click"
    }

  # github_team.repo_admin_team["django-click"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the django-click repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-click-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["django-click"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the django-click repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-click-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["django-click"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the django-click repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-click"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["django-click"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "FlipperPA"
        }
+       members {
+           role     = "member"
+           username = "GaretJax"
        }
    }

  # github_team_members.repo_team_members["django-click"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "FlipperPA"
        }
+       members {
+           role     = "member"
+           username = "GaretJax"
        }
    }

  # github_team_repository.repo_admin_team_access["django-click"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "django-click"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["django-click"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "django-click"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["django-click"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "django-click"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["django-click"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 2 to import, 11 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #77](https://github.com/django-commons/membership/actions/runs/13566874741)